app/Models/CrudModel.php

INSERT INTO `datoscrud` (`nombre`, `dato1`, `dato2`) VALUES ('Anna', 'Luis', 'Flores')
---
    public function insertar($datos){
        $Nombres= $this->db->table('datoscrud');
        $Nombres->insert($datos);

UPDATE `datoscrud` SET `nombre` = 'Stephanie', `dato1` = 'Ucan Best', `dato2` = 'Bustillo'
WHERE `idNombre` = '1'
---
    public function actualizar($data, $idNombre) {
        $Nombres = $this->db->table('datoscrud');
        $Nombres->set($data);
        $Nombres->where('idNombre', $idNombre);
        return $Nombres->update();